import "./AboutUs.css";

const AboutUs: React.FC = () => {
  return (
    <>
      <h1>Про нас</h1>
      <div className="about-us-container">
        <section className="about-section">
          <h2>Актуальність</h2>
          <p>
            З огляду на зростання волонтерського руху та необхідність ефективної
            взаємодії між волонтерськими організаціями та військовими
            угрупованнями, важливо забезпечити системне управління цими
            процесами.
          </p>
          <p>
            Відсутність єдиної платформи для реєстрації, координації та
            адміністрування діяльності фондів і бригад ускладнює взаємодію та
            прозорість збору коштів і ресурсів. Запропонована система сприятиме
            оптимізації цих процесів.
          </p>
        </section>

        <section className="about-section">
          <h2>Мета</h2>
          <p>
            Розробка веб-платформи для автоматизації управління волонтерськими
            фондами та військовими угрупованнями, що забезпечить прозору
            реєстрацію, адміністрування та координацію їхньої діяльності.
          </p>
        </section>

        <section className="about-section">
          <h2>Завдання</h2>
          <ul>
            <li>
              Реалізувати механізм реєстрації та автентифікації користувачів із
              різними рівнями доступу.
            </li>
            <li>
              Надати можливість створення та керування волонтерськими фондами,
              включно з адмініструванням профілів.
            </li>
            <li>
              Забезпечити механізм реєстрації військових угруповань із
              підтвердженням їхньої легітимності.
            </li>
            <li>
              Розробити систему обліку та адміністрування зборів коштів із
              підтвердженням отримання фінансування військових угруповань.
            </li>
            <li>Запровадити модуль управління військовими запитами.</li>
            <li>
              Реалізувати систему звітності для моніторингу діяльності фондів і
              військових угруповань.
            </li>
          </ul>
        </section>
      </div>
    </>
  );
};

export default AboutUs;
